tap "common-fate/granted"
tap "smudge/smudge"
tap "stripe/stripe-cli"
tap "supabase/tap"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Official Amazon AWS command-line interface
brew "awscli"
# Pyright fork with various improvements and built-in pylance features
brew "basedpyright"
# Language Server for Bash
brew "bash-language-server"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Searches a binary image for embedded files and executable code
brew "binwalk"
# Toolchain of the web
brew "biome"
# Python code formatter
brew "black"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# Console Matrix
brew "cmatrix"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Securely send things from one computer to another
brew "croc"
# Top-like interface for container metrics
brew "ctop"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Tool for exploring each layer in a docker image
brew "dive"
# Language service for Docker Compose documents
brew "docker-compose-langserver"
# Language server for Dockerfiles powered by Node, TypeScript, and VSCode
brew "dockerfile-language-server"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# Language Server and Debugger for Elixir
brew "elixir-ls"
# Multi-threaded file-tree visualizer and disk usage analyzer
brew "erdtree"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Create thumbnails for your video files
brew "ffmpegthumbnailer"
# Firebase command-line tools
brew "firebase-cli"
# Command-line tools for fly.io services
brew "flyctl"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# Render markdown on the CLI
brew "glow"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Task is a task runner/build tool that aims to be simpler and easier to use
brew "go-task"
# Fast linters runner for Go
brew "golangci-lint"
# Terminal based graphical activity monitor inspired by gtop and vtop
brew "gotop"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Improved top (interactive process viewer)
brew "htop"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# GNU utilities for networking
brew "inetutils"
# Enhanced version of john, a UNIX password cracker
brew "john-jumbo"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Postgres C API library
brew "libpq"
# Powerful, lightweight programming language
brew "lua"
# Language Server for the Lua language
brew "lua-language-server"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Package manager for the Lua programming language
brew "luarocks"
# CLI for Node.js style checker and lint tool for Markdown files
brew "markdownlint-cli"
# Mac App Store command-line interface
brew "mas"
# Fly through your shell history
brew "mcfly"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# NCurses Disk Usage
brew "ncdu"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Control nvim processes using `nvr` command-line tool
brew "neovim-remote"
# Port scanning utility for large networks
brew "nmap"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# AI coding agent, built for the terminal
brew "opencode"
# Development kit for the Java programming language
brew "openjdk"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Password manager
brew "pass"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# General-purpose scripting language
brew "php"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Fast, disk space efficient package manager
brew "pnpm"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@15"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Sound system for POSIX OSes
brew "pulseaudio"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Multi-agent orchestration framework for autonomous AI task completion
brew "ralph-orchestrator"
# Pack repository contents into a single AI-friendly file
brew "repomix"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"
# Rust toolchain installer
brew "rustup"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Simple keystroke visualizer
brew "showkey"
# Manage multiple Solidity compiler versions
brew "solc-select"
# Launcher to analyze a project with SonarQube
brew "sonar-scanner"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Penetration testing for SQL injection and database servers
brew "sqlmap"
# Test SSL/TLS enabled services to discover supported cipher suites
brew "sslscan"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Opinionated Lua code formatter
brew "stylua"
# LSP for TailwindCSS
brew "tailwindcss-language-server"
# Terraform Language Server
brew "terraform-ls"
# Powerful free data recovery utility
brew "testdisk"
# Define your dev environment as code. For microservice apps on Kubernetes
brew "tilt"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Plugin manager for tmux
brew "tpm"
# Vulnerability scanner for container images, file systems, and Git repos
brew "trivy"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# URL extractor/launcher
brew "urlview"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Vi 'workalike' with many additional features
brew "vim"
# Language servers for HTML, CSS, JavaScript, and JSON extracted from vscode
brew "vscode-langservers-extracted"
# Manage the desktop wallpaper
brew "wallpaper"
# Execute commands when watched files change
brew "watchexec"
# Internet file retriever
brew "wget"
# XML command-line utilities
brew "xmlstarlet"
# JavaScript package manager
brew "yarn"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Zsh port of Fish shell's history search
brew "zsh-history-substring-search"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# The easiest way to access your cloud.
brew "common-fate/granted/granted"
# A CLI for configuring 'Night Shift' on macOS 🌕🌖🌗🌘🌑
brew "smudge/smudge/nightlight"
# Stripe CLI utility
brew "stripe/stripe-cli/stripe"
# Supabase CLI
brew "supabase/tap/supabase"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Communications service
cask "amazon-chime"
# Memory training application
cask "anki"
# AI Coding Agent IDE
cask "antigravity"
# Chromium based browser
cask "arc"
# Multi-track audio editor and recorder
cask "audacity"
# Web browser focusing on privacy
cask "brave-browser"
# Web security testing toolkit
cask "burp-suite"
# App to write and organise your ideas
cask "capacities"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# OpenAI's official browser with ChatGPT built in
cask "chatgpt-atlas"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Web browser with integrated AI assistant
cask "comet"
# Write, edit, and chat about your code with AI
cask "cursor"
# Databases and SQL IDE
cask "datagrip"
# Universal database tool and SQL client
cask "dbeaver-community"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Developer platform
cask "dotnet-sdk"
# Multi-platform multi-messaging app
cask "ferdium"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox@developer-edition"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-symbols-only-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Windows manager and desktop organiser
cask "hazeover"
# HTTP(S) debugging proxy, analyzer, and client
cask "http-toolkit"
# Tool to optimise images to a smaller size
cask "imageoptim"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# App to visualise, validate and format JSON datasets
cask "json-viewer"
# Password manager application and digital vault
cask "keeper-password-manager"
# Open-source keystroke visualiser
cask "keycastr"
# ZSA keyboard firmware flasher
cask "keymapp"
# Code notebooks for Elixir developers
cask "livebook"
# Software for Logitech devices
cask "logi-options+"
# Screen and video recording software
cask "loom"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Interactive tool for analyzing MongoDB data
cask "mongodb-compass"
# VPN client
cask "mullvad-vpn"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Open-source software for live streaming and screen recording
cask "obs"
# Virtual Green-screen and Low-Light Enhancement OBS Plugin
cask "obs-backgroundremoval"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Client program for the OpenVPN Access Server
cask "openvpn-connect"
# Collaboration platform for API development
cask "postman"
# Quick Look generator for Markdown files
cask "qlmarkdown"
# Control your tools with a few keystrokes
cask "raycast"
# GUI for streamlined Redis application development
cask "redis-insight"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin@8"
# Open-source code editor
cask "visual-studio-code"
# Open-source code editor
cask "visual-studio-code@insiders"
# Multimedia player
cask "vlc"
# Network protocol analyzer
cask "wireshark-app"
# Free and open source web app scanner
cask "zap"
# Multiplayer code editor
cask "zed"
# Gecko based web browser
cask "zen"
# Video communication and virtual meeting platform
cask "zoom"
mas "Keynote", id: 409183694
vscode "bierner.markdown-mermaid"
vscode "bradlc.vscode-tailwindcss"
vscode "docker.docker"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot-chat"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "hackiai.hacki"
vscode "jakebecker.elixir-ls"
vscode "kamikillerto.vscode-colorize"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vsliveshare.vsliveshare"
vscode "phoenixframework.phoenix"
vscode "phplasma.csv-to-table"
vscode "prisma.prisma"
vscode "rickaym.manim-sideview"
vscode "ritwickdey.liveserver"
vscode "svelte.svelte-vscode"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
