tap "anomalyco/tap"
tap "common-fate/granted"
tap "smudge/smudge"
tap "stripe/stripe-cli"
tap "supabase/tap"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Python code formatter
brew "black"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Securely send things from one computer to another
brew "croc"
# Top-like interface for container metrics
brew "ctop"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Tool for exploring each layer in a docker image
brew "dive"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# Language Server and Debugger for Elixir
brew "elixir-ls"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Create thumbnails for your video files
brew "ffmpegthumbnailer"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# Render markdown on the CLI
brew "glow"
# GNU typing tutor
brew "gnu-typist"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Task is a task runner/build tool that aims to be simpler and easier to use
brew "go-task"
# Terminal based graphical activity monitor inspired by gtop and vtop
brew "gotop"
# Improved top (interactive process viewer)
brew "htop"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# GNU utilities for networking
brew "inetutils"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Postgres C API library
brew "libpq"
# Powerful, lightweight programming language
brew "lua"
# Language Server for the Lua language
brew "lua-language-server"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Package manager for the Lua programming language
brew "luarocks"
# CLI for Node.js style checker and lint tool for Markdown files
brew "markdownlint-cli"
# Mac App Store command-line interface
brew "mas"
# Fly through your shell history
brew "mcfly"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# NCurses Disk Usage
brew "ncdu"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Control nvim processes using `nvr` command-line tool
brew "neovim-remote"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Fast, disk space efficient package manager
brew "pnpm"
# Object-relational database system
brew "postgresql@15"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Multi-agent orchestration framework for autonomous AI task completion
brew "ralph-orchestrator"
# Pack repository contents into a single AI-friendly file
brew "repomix"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"
# Rust toolchain installer
brew "rustup"
# Autoformat shell script source code
brew "shfmt"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Penetration testing for SQL injection and database servers
brew "sqlmap"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Opinionated Lua code formatter
brew "stylua"
# Terraform Language Server
brew "terraform-ls"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Plugin manager for tmux
brew "tpm"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# URL extractor/launcher
brew "urlview"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Vi 'workalike' with many additional features
brew "vim"
# Execute commands when watched files change
brew "watchexec"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Zsh port of Fish shell's history search
brew "zsh-history-substring-search"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# The AI coding agent built for the terminal.
brew "anomalyco/tap/opencode"
# The easiest way to access your cloud.
brew "common-fate/granted/granted"
# A CLI for configuring 'Night Shift' on macOS 🌕🌖🌗🌘🌑
brew "smudge/smudge/nightlight"
# AI Coding Agent IDE
cask "antigravity"
# Web security testing toolkit
cask "burp-suite"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# OpenAI's Codex desktop app for managing coding agents
cask "codex-app"
# Web browser with integrated AI assistant
cask "comet"
# Write, edit, and chat about your code with AI
cask "cursor"
# Universal database tool and SQL client
cask "dbeaver-community"
# App to build and share containerised applications and microservices
cask "docker-desktop"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-symbols-only-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Tool to optimise images to a smaller size
cask "imageoptim"
# Password manager application and digital vault
cask "keeper-password-manager"
# ZSA keyboard firmware flasher
cask "keymapp"
# Code notebooks for Elixir developers
cask "livebook"
# Software for Logitech devices
cask "logi-options+"
# Screen and video recording software
cask "loom"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Client program for the OpenVPN Access Server
cask "openvpn-connect"
# Collaboration platform for API development
cask "postman"
# Quick Look generator for Markdown files
cask "qlmarkdown"
# Control your tools with a few keystrokes
cask "raycast"
# Team communication and collaboration software
cask "slack"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"
vscode "bierner.markdown-mermaid"
vscode "bradlc.vscode-tailwindcss"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "elixir-lsp.elixir-ls"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "hashicorp.terraform"
vscode "jakebecker.elixir-ls"
vscode "kamikillerto.vscode-colorize"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vsliveshare.vsliveshare"
vscode "phoenixframework.phoenix"
vscode "phplasma.csv-to-table"
vscode "prisma.prisma"
vscode "rickaym.manim-sideview"
vscode "ritwickdey.liveserver"
vscode "svelte.svelte-vscode"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
