##### PREFLIGHT ########
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'heroku/brew'
tap 'mas-cli/tap'

### Special for fonts
brew 'svn'

##### FONTS #####
cask 'font-fira-code'
cask 'font-hack-nerd-font'
cask 'font-source-code-pro'

##### FORMULAES #####
brew 'ack'
brew 'awscli'
brew 'bat'
brew 'binwalk'
brew 'cmatrix'
brew 'coreutils'
brew 'ctop'
brew 'curl', link: true
brew 'dive'
brew 'exiftool'
brew 'exploitdb'
brew 'fd'
brew 'ffmpeg'
brew 'gdb'
brew 'gh'
brew 'git'
brew 'go'
brew 'gobuster'
brew 'gotop'
brew 'heroku'
brew 'htop'
brew 'imagemagick'
brew 'inetutils'
brew 'john-jumbo'
brew 'kubectl'
brew 'lua'
brew 'masscan'
brew 'ncdu'
brew 'netcat'
brew 'nmap'
brew 'node'
brew 'nvim'
brew 'pngcheck'
brew 'postgresql'
brew 'pre-commit'
brew 'pulseaudio'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'python3'
brew 'speedtest-cli'
brew 'ripgrep'
brew 'ruby'
brew 'rustup-init'
brew 'rust-analyzer'
brew 'socat'
brew 'speedtest-cli'
brew 'sqlmap'
brew 'terraform-ls'
brew 'tfenv'
brew 'tmux'
brew 'tor'
brew 'tor-browser'
brew 'tree'
brew 'urlview'
brew 'vim'
brew 'wget'
brew 'zsh'

######## CASK ########
cask 'adobe-creative-cloud'
cask 'alfred'
cask 'angry-ip-scanner'
cask 'anki'
cask 'balenaetcher'
cask 'betterzip'
cask 'bloodhound'
cask 'burp-suite'
cask 'captin'
cask 'datagrip'
cask 'discord'
cask 'docker'
cask 'figma'
cask 'font-hack-nerd-font'
cask 'firefox-developer-edition'
cask 'folx'
cask 'ghidra'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'hammerspoon'
cask 'istat-menus' # Actual Version ^6
cask 'iterm2'
cask 'little-snitch'
# cask 'metasploit' # Failing due to 404
cask 'micro-snitch'
cask 'mongodb-compass'
cask 'ngrok'
cask 'nordvpn'
cask 'obsidian'
cask 'postman'
cask 'qlmarkdown'
cask 'removebg'
cask 'sip'
cask 'slack'
cask 'spotify'
cask 'telegram'
cask 'tunnelblick'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'
cask 'wireshark'
cask 'xquartz'
cask 'zoom'

####### Mac Application Store #########
mas 'Keynote', id: 409183694
mas 'Presentify - Screen Annotation', id: 1507246666
mas 'Spark – Email App by Readdle', id: 1176895641
mas 'GIPHY Capture. The GIF Maker', id: 668208984

####### LUXOR #######
brew 'automake'
brew 'berkeley-db@4'
brew 'boost'
brew 'miniupnpc'
cask 'linear-linear'

