##### PREFLIGHT ########
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'heroku/brew'

##### FONTS #####
cask 'font-fira-code'
cask 'font-source-code-pro'

##### PERSONAL #####
brew 'ack'
brew 'ag'
brew 'awscli'
brew 'binwalk'
brew 'cmatrix'
brew 'coreutils'
brew 'ctop'
brew 'curl', link: true
brew 'dive'
brew 'exiftool'
brew 'ffmpeg'
brew 'gdb'
brew 'git'
brew 'go'
brew 'gobuster'
brew 'heroku'
brew 'htop'
brew 'imagemagick'
brew 'inetutils'
brew 'ispell'
brew 'john-jumbo'
brew 'kubectl'
brew 'lua'
brew 'masscan'
brew 'minikube'
brew 'ncdu'
brew 'netcat'
brew 'nmap'
brew 'node'
brew 'pngcheck'
brew 'pyenv'
brew 'pyenv-virtualenv'
# brew 'pyenv-virtualenvwrapper'
brew 'python3'
brew 'ruby'
brew 'socat'
brew 'speedtest-cli'
brew 'sqlmap'
brew 'terraform-ls'
brew 'tfenv'
brew 'the_silver_searcher'
brew 'tmux'
brew 'tree'
brew 'vim'
brew 'wget'
brew 'zsh'
cask '1password'
cask 'adobe-creative-cloud'
cask 'adoptopenjdk'
cask 'alfred'
cask 'angry-ip-scanner'
cask 'balenaetcher'
cask 'betterzip'
cask 'bloodhound'
cask 'burp-suite'
cask 'datagrip'
cask 'discord'
cask 'docker'
cask 'emacs'
cask 'figma'
cask 'firefox-developer-edition'
cask 'folx'
cask 'franz'
cask 'freecad'
cask 'ghidra'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'hammerspoon'
cask 'istat-menus' # Actual Version ^6
cask 'iterm2'
cask 'itsycal' # Config 'E, MMM d HH:mm'
cask 'metasploit'
cask 'mongodb-compass'
cask 'ngrok'
cask 'nordvpn'
cask 'spotify'
cask 'tunnelblick'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'visual-studio-code'
cask 'vlc'
cask 'wireshark'
cask 'xquartz'
cask 'zoomus'

